{
    "projects": [
        {
            "title": "How to catch a catfisher",
            "url": "https://www.theguardian.com/technology/ng-interactive/2019/feb/20/how-to-catch-a-catfisher",
            "description": "Design, development and art direction for a Guardian US feature on what happens when someone uses your photos to catfish people"
        },
        {
            "title": "The World Cook",
            "url": "http://www.theworldcook.com",
            "description": "Design, development and photography for an interactive cookbook of recipes from all 32 nations at the 2018 FIFA World&nbsp;Cup"
        },
        {
            "title": "3,121 Desperate Journeys",
            "url": "https://www.theguardian.com/us-news/ng-interactive/2018/oct/14/donald-trump-zero-tolerance-policy-special-investigation-immigrant-journeys",
            "description": "Data visualisation and art direction for a piece looking at the human cost behind Trump's zero tolerance&nbsp;policy. Nominated for an SPD award for digital information graphics"
        },
        {
            "title": "Firings and the Fury",
            "url": "https://www.theguardian.com/us-news/ng-interactive/2018/jul/05/donald-trump-firings-resignations-white-house-full-list-latest",
            "description": "A way to keep track of President Trump's ever-changing inside&nbsp;circle. Nominated for an SPD award for original photo-illustration"
        },
        {
            "title": "Monthly Mix",
            "url": "http://www.monthly.mx",
            "description": "Design and development for a personal project that highlights the best new music of the&nbsp;month"
        },
        {
            "title": "Trump-Russia Investigation – The Key Questions",
            "url": "https://www.theguardian.com/us-news/ng-interactive/2017/dec/08/donald-trump-russia-investigation-key-questions-latest-news-collusion-timeline",
            "description": "An interactive investigation pinboard of the numerous questions surrounding Mueller's investigation"
        },
        {
            "title": "Go Set A Watchman Extract",
            "url": "https://www.theguardian.com/books/ng-interactive/2015/jul/10/go-set-a-watchman-read-the-first-chapter",
            "description": "Art direction, design and development for an exclusive extract of Harper Lee’s second&nbsp;novel"
        },
        {
            "title": "The Guardian",
            "url": "https://www.theguardian.com",
            "description": "Design and development of fronts and special features for the first responsive relaunch of theguardian.com"
        },
        {
            "title": "BBC Archive",
            "url": "https://vimeo.com/22552332",
            "description": "D&AD award winning entry that pitched a more interactive and representive version of the BBC&nbsp;Archive"
        }
    ],

    "otherProjects": [
        {
            "title": "Rothko Me",
            "url": "http://www.rothko.me",
            "description": "An experiment with CSS filters based on the art of Mark&nbsp;Rothko"
        },
        {
            "title": "Qhuery",
            "url": "http://www.qhuery.com/",
            "description": "A CSS colour picker using only media&nbsp;queries"
        },
        {
            "title": "US Midterms 2018 Results",
            "url": "https://www.theguardian.com/us-news/ng-interactive/2018/nov/06/midterm-elections-2018-live-results-latest-winners-and-seats",
            "description": "Live results page for 2018 US&nbsp;Midterms"
        },
        {
            "title": "Black Radicals – in Pictures",
            "url": "https://www.theguardian.com/us-news/ng-interactive/2018/jul/30/america-black-radicals-timeline-in-pictures",
            "description": "Archive photography and video provide historic background for a series on black&nbsp;radicials"
        },
        {
            "title": "Who Will Run in 2020?",
            "url": "https://www.theguardian.com/us-news/ng-interactive/2019/jan/17/2020-election-candidates-list-democrats-primaries-trump-bernie-sanders-joe-biden-elizabeth-warren-kamala-harris-beto-o-rourke-running",
            "description": "A complete list of Democrat candidates vying to to take on Trump in&nbsp;2020"
        },
        {
            "title": "Sound of Atlanta",
            "url": "https://www.theguardian.com/cities/ng-interactive/2018/oct/22/sound-of-atlanta",
            "description": "An interactive playlist of Atlanta's up and coming music&nbsp;artists"
        },
        {
            "title": "How Much Does a Tech Bro Cost?",
            "url": "https://www.theguardian.com/cities/ng-interactive/2018/jul/02/how-much-does-a-tech-bro-cost",
            "description": "Analysis of the US government's tax giveaways to big&nbsp;tech"
        }
    ],

    "posts": [
        {
            "title": "Concrete Treehouses",
            "date": "2014-07-02 02:00:00",
            "imageFormat": "jpg",
            "body": "When an architect is given a brief they first need to consider the appropriateness of the materials available to them. They should understand the functional and aesthetic benefits, and limitations, given the context they're placing it into. For example, you wouldn't apply brutalist techniques when designing a treehouse. The tree would buckle under the weight of concrete, a material best left for the Barbicans of the world. \n \n As designers for screen we face similar choices around structure. The recent debate surrounding the hamburger menu and its place within a shared visual language comes to mind. Like brutalism it has a place, but like all solutions they're designed to answer specific problems. \n \n No amounts of A/B test results are needed to show that a collapsed menu which contains only three items might not be appropriate. While it shouldn't stop you from trying, you don't need to build a concrete treehouse to know that it might fail. Initially applying a solution out of context can help form new ideas, however, the results of such an experiment don't render the original solution useless in all situations. To think that they do would be irresponsible. \n \n As designers in a relatively young field we should be hesitant to reject ideas. Maybe the hamburger icon's time will pass but as a community we should be willing to experiment. It's the only way to expand our design vocabulary to be suitable for treehouses and Barbicans alike."
        },
        {
            "title": "Dirty Laundry",
            "date": "2015-01-05 08:00:00",
            "imageFormat": "gif",
            "body": "I’m not normally one for New Year’s Resolutions but this year I’ll make an exception for one of my more questionable habits. I'm not talking about clichéd promises like quitting smoking or to visit the gym more, my problem is moaning about other people’s work online. \n \n We’ve all had this happen to us before. Seemingly out of nowhere, we’re forced to learn our way around a re-designed app or a newly responsive website. As more of an insider I’d like to think I’m more receptive to changes, but that isn’t always the case. \n \n In the past I’ve taken to Twitter and joined in with the vitriol towards the latest bad flavour of the week or #uxfail. Only to briefly feel better for having vented and ultimately be left with the same issue. \n \n The truth is I know nothing of the circumstances that the work was created in. I know nothing of the potentially problematic deadlines that might have forced cuts. I don’t even know anything about the politics that might have slowed the project down. Admittedly none of these should completely excuse poor design, nor are they the only possible excuses. However, they should be considerations for those like myself that should know better before vocalising gripes in public. \n \n Fleeting catharsis aside, I’ve found very little redeemable about shouting into a text box. This year I’m going to change tact. If I catch myself heading towards Twitter to have a bit of a moan, I’ll stop — or at least I’ll try. \n \n It seems to me that the best way to solicit change is to talk directly to those that can allow for it, those that worked on the product. I’d be surprised if the response isn’t one of agreement or simple oversight. At the very least you’ll get an answer to why something is the way it is. The best case, you won’t feel as helpless and the issue you were aggrieved by now has a chance of being looked at. \n \n Negative feedback is a necessary part of the process, it can sometimes feel like a constant evil in our business. But for those that should know better, airing dirty laundry in public feels gross no matter what side of it you’re on. This year, I’ll be trying to do my part to change that. I hope you join me."
        },
        {
            "title": "List of Shame",
            "date": "2015-03-05 14:00:00",
            "imageFormat": "gif",
            "body": "I’ll be presumptuous and guess that if you’re reading this you too keep a list of ideas somewhere. Made up of apps, websites and side projects. Intentions made to yourself to learn something new, create something useful or simply to be something different from the day job. \n \n My list is full of bad ideas. Some of them I don’t understand anymore. Occasionally there's a decent one. A rare few graduate into an abandoned GitHub repo. An even rarer few see the light of day. I used to beat myself up about the lack of personal projects I would release over a year. Put it down to the quality of ideas or lousy discipline, my list just kept growing. \n \n Last month a future piece of abandonware had me writing Ruby. I haven’t released a single project where I meaningfully wrote Ruby. Yet writing this Ruby plugin required nominal Googling. \n \n I’ve since realised that all side projects, whether they’re a polished piece of work or simply a couple of words in a list, have their benefits. \n \n Last month I benefited from an exposure to Ruby. This month might be the knowledge of an API or simply the flexing of problem solving muscles. All gained from those bad ideas and abandoned GitHub repos. Releasing a project can be rewarding but it's easy to forget that it isn’t the only reward on offer."
        },
        {
            "title": "Foul Language",
            "date": "2015-03-30 10:30:00",
            "imageFormat": "gif",
            "body": "As someone who has tended to work in relatively large companies, start-ups really intrigue me. A smaller closely-knit team with, usually, more focus on a single problem. Sign me up. \n \n Yet every time a job spec surfaces on my screen I'm instantly dismayed by the language used. Disruption, engagement, users, unicorns. All words part of a vernacular that has since escaped the start-up bubble and bled into digital design. \n \n We talk about disruption when we simply mean a new idea in a tired space. Engagement is inhuman shorthand used when discussing whether people enjoy what we make. We talk about our users as if they're just numbers to acquire. And as for anyone who calls themselves a unicorn… \n \n At University I decided early on that I didn’t want to go into advertising because of the way most agencies talked about their work and those that viewed it. It felt gross, dishonest and elitist. These are words that most people would naturally associate with advertising. Not digital design. At least they shouldn't \n \n I’m not immune to drawing from this vocabulary myself. However, recently I’ve started to make more of a conscious effort to stop. Starting by calling those that use the Guardian website *readers* rather than *users*. \n \n All industries inevitably form their own lexicon but our work is  ultimately for the benefit of others. For this reason we should speak as clearly and inclusively as possible. Call me naive, but I believe a more humanistic approach in discussing problems will show in the solutions we choose and build. And that’s something everybody can understand. \n \n *Unicorn illustration by Pieter J. Smits from the [Noun Project](http://thenounproject.com/)*"
        }
    ]
}
